{
    "Analizar Código": "Actúa como un analizador de código experto. Describe en 1 párrafo conciso (< 100 palabras):\n\nFunción principal: ¿Qué hace el código globalmente? (Ej: 'Procesa datos de API y genera informes').\n\nOrganización: ¿Cómo se estructura? (Ej: 'Clases X y Y manejan lógica, módulo Z gestiona I/O').\n\nInteracción: ¿Cómo fluyen los datos entre componentes? (Ej: 'El componente A llama a B para validar inputs')",
    "Instrucciones GUI": "Diseño de la Interfaz Gráfica de Usuario (GUI)\n\nSe ha diseñado una GUI que prioriza la claridad, la eficiencia y la profesionalidad, con el objetivo de optimizar la experiencia del usuario en la gestión de documentos.\n\nPaleta de Colores Corporativa:\n\nColor Primario: Azul institucional (#2B579A) para destacar elementos interactivos y la jerarquía visual.\nColor Secundario: Blanco puro (#FFFFFF) como fondo, combinado con gris neutro (#E1E1E1) para bordes y separadores.\nColor de Acento: Naranja de alerta (#D83B01) para notificaciones críticas y acciones que requieren atención.\n\nTipografía:\n\nTítulos: Segoe UI Semibold (16pt) en azul institucional para una lectura clara y jerárquica.\nCuerpo de Texto: Segoe UI Regular (10pt) con un espaciado de caracteres (tracking) de 0.5px para mejorar la legibilidad.\nEtiquetas: Sistema de contraste claro (70% negro sobre blanco) para asegurar la accesibilidad.\n\nComponentes de la Interfaz de Usuario:\n\nBotones: Diseño plano (flat design) con una sutil sombra de 2px al pasar el cursor, esquinas redondeadas de 3px y transiciones suaves de 300ms (ease-in-out).\nCampos de Entrada: Bordes activos en azul (#2B579A) de 1px y marcadores de posición (placeholders) en gris medio (#909090).\n\nJerarquía Visual:\n\nCinta Superior: Barra de título con el logotipo tipográfico para una identificación rápida.\nZona de Acción Principal: Disposición de elementos de izquierda a derecha con una cuadrícula implícita para un flujo de trabajo intuitivo.\nRetroalimentación de Estado: Consejos emergentes (tooltips) en naranja o verde (#00B050) según el contexto, proporcionando información clara y oportuna.\n\nPrincipios de Experiencia de Usuario (UX):\n\nDensidad de contenido controlada mediante un sistema de cuadrícula de 8px.\nAlineación de borde a borde (Edge-to-Edge) en modos responsivos para adaptarse a diferentes tamaños de pantalla.\nIconografía minimalista con líneas de 2px de grosor para una interfaz limpia y moderna.\n\nEfecto Final:\n\nSe busca transmitir profesionalismo corporativo y garantizar una usabilidad óptima para la gestión eficiente de documentos.\n\nFuncionalidad Adicional:\n\nSe incluirá un botón de ayuda que explique la función del codigo y de cada elemento de la interfaz y muestre el nombre del creador: J. Gabriel Calderón.",
    "Asistencia para Gestión de TDAH": "Actúa como mi guía personal. Tengo TDAH y me cuesta organizar tareas, mantener el enfoque y recordar detalles. ¿Podrías ayudarme estructurando mis actividades en pasos simples, recordándome plazos importantes y dando pausas programadas? Por ejemplo: dividir proyectos grandes en microtareas, usar recordatorios amables y evitar sobrecarga de información. ¿Estás lista?",
    "Entrégame código actualizado": "Genera el código completo del proyecto actual, listo para ejecutarse, incluyendo todas las mejoras y modificaciones que hemos discutido.",
    "Mejora prompt": "Se requiere optimizar la redacción del texto entre comillas para asegurar su máxima coherencia, argumentación sólida y calidad. Esto implica una revisión crítica de la estructura y precisión del lenguaje, garantizando que el mensaje se transmita de forma efectiva y sin ambigüedades.\n\n\" \"",
    "Análisis Exhaustivo": "Realiza un análisis exhaustivo breve y conciso del archivo proporcionado, evaluando su funcionalidad, aplicación práctica y estructura. Desglosa los componentes y sugiere posibles mejoras."
}